model {
  center_net {
    num_classes: 1
    feature_extractor {
      type: "mobilenet_v2_fpn"
      channel_means: [0.485, 0.456, 0.406]
      channel_stds: [0.229, 0.224, 0.225]
      bgr_ordering: false
    }
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 512
        max_dimension: 512
      }
    }
    object_detection_task {
      task_loss_weight: 1.0
      offset_loss_weight: 1.0
      scale_loss_weight: 0.1
      localization_loss {
        l1_localization_loss {
        }
      }
    }
    keypoint_estimation_task {
      task_loss_weight: 1.0
      localization_loss {
        l1_localization_loss {
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.25
        }
      }
    }
    max_num_detections: 100
    use_bfloat16: false
    post_processing {
      batch_non_max_suppression {
        score_threshold: 0.05
        iou_threshold: 0.5
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  batch_size: 24
  optimizer {
    rms_prop_optimizer: {
      learning_rate: {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.004
          decay_steps: 800720
          decay_factor: 0.95
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
  }
  fine_tune_checkpoint: "C:/Users/jackson/checkboxdetection/model/centernet_mobilenetv2_fpn_od/checkpoint/ckpt-301"
  from_detection_checkpoint: true
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_crop_image {
    }
  }
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "C:/jackson/checkboxdetection/data/train.record"
  }
  label_map_path: "C:/jackson/checkboxdetection/training/object-detection.pbtxt"
}

eval_config: {
  num_examples: 40
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "C:/jackson/checkboxdetection/data/test.record"
  }
  label_map_path: "C:/jackson/checkboxdetection/training/object-detection.pbtxt"
  shuffle: false
  num_readers: 1
}
